# RebarSystemBarTypeBottomDirn1 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemBarTypeBottomDirn1 Property
ParameterTypeId Class See Also
---
"Bottom Major Bar Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemBarTypeBottomDirn1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemBarTypeBottomDirn1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemBarTypeBottomDirn1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace